{
    "portfolio": {
        "about": "À PROPOS",
        "game-programmer": "PROGRAMMEUR DE JEUX VIDÉO",
        "email": "Courriel",
        "phone": "Téléphone",
        "summary": "Je m'appelle Christopher Robidas. Je suis un gamer depuis que je suis en âge de tenir une manette et un programmeur de jeux vidéo passionné. Je suis reconnu comme un bon joueur d'équipe et pour ma grande capacité à communiquer, à m'adapter et à apprendre.",
        "current-role": "Emploi actuel",
        "current-role-value": "Développeur Back End à Gameloft Montréal",
        "education": "Éducation",
        "education-value": "Baccalauréat en informatique - Université de Sherbrooke",
        "technical-skills": "Compétences techniques",
        "languages": "Langages:",
        "technologies": "Technologies:",
        "softwares": "Logiciels:",
        "project-summary": "Résumé",
        "project-tasks": "J'ai travaillé sur ce qui suit:",
        "project-play": "Jouer",
        "project-play-in-browser": "Jouer en ligne",
        "project-source": "Code source",
        "project-arcane-echoes": {
            "summary": "Jeu d'aventure dans lequel vous devez obtenir un parchemin magique protégé par des âmes corrompues afin de quitter une dimension alternative. Réalisé pour le game jam du Ludum Dare 55.",
            "task1": "AI d'ennemis pouvant patrouiller, éviter des obstacles, ont un champ de vision et qui deviennent agressifs si le joueur passe à l'intérieur.",
            "task2": "Type d'ennemi AI attaquant au corps-à-corps et un autre lançant des boules de feu.",
            "task3": "Logique de spawn et de mort des ennemis AI.",
            "task4": "Intégrer les modèles, les textures, VFXs, les animations et l'audio.",
            "role": "Rôle: Programmeur",
            "team": "Taille de l'équipe: 8",
            "time": "Fenêtre de temps: 72 heures",
            "skills": "Compétences techniques: Unity et C#"
        },
        "project-test": {
            "summary": "Jeu de type Five Nights at Freddy's où vous devez tricher lors d'un examen sans vous faire surprendre par votre professeur. Réalisé pour le Game Jam Sherbrooke 2024.",
            "task1": "Puzzle Captcha sur le téléphone cellulaire.",
            "task2": "UI du menu de fin de jeu affichant le résultat du joueur.",
            "task3": "Jump scare du tigre faisant perdre la partie au joueur.",
            "task4": "Paramètres de mode d'affichage et de résolution et le UI pour les modifier (ne s'affiche pas dans la version WebGL).",
            "role": "Rôle: Programmeur",
            "team": "Taille de l'équipe: 5",
            "time": "Fenêtre de temps: 48 heures",
            "skills": "Compétences techniques: Unity et C#"
        },
        "project-sauve-chouris": {
            "summary": "Jeu d'aventure et d'horreur où vous devez sauver votre ami chauve-souris tout en évitant de vous faire attraper par une grand-mère et son chat. Réalisé pour le Game Jam Sherbrooke 2023.",
            "task1": "Mécanique de jeu d'écholocation permettant de se repérer dans les niveaux.",
            "task2": "Menu principal, menu de sélection de niveau, menu pause et menu game over.",
            "task3": "Logique des cinématiques affichant les images et le texte.",
            "role": "Rôle: Programmeur",
            "team": "Taille de l'équipe: 6",
            "time": "Fenêtre de temps: 48 heures",
            "skills": "Compétences techniques: Unity, C# et Wwise"
        },
        "project-purrfect-escape": {
            "summary": "Jeu d'évasion où vous incarnez un chat voulant s'échapper de sa maison, mais pour ce faire, il doit résoudre des énigmes.",
            "task1": "Système d'interaction avec des petits cercles et une patte de chat indiquant aux joueurs les objets avec lesquels ils peuvent interagir.",
            "task2": "Petit écran et boutons au mur pour saisir le code secret.",
            "task3": "Conception du niveau, y compris la décision de l'agencement de la maison et de l'emplacement des énigmes et des éléments clés.",
            "role": "Rôle: Programmeur et concepteur de niveau",
            "team": "Taille de l'équipe: 2",
            "time": "Fenêtre de temps: 1 semaine",
            "skills": "Compétences techniques: Unity et C#"
        },
        "project-stepping-stones": {
            "summary": "Runner où vous voyagez à travers les âges pour ramener notre histoire. Réalisé pour le Game Jam Montréal 2023.",
            "task1": "Contrôleur de personnage qui court automatiquement, peut sauter, utiliser une torche pour brûler des murs et bloquer des météores avec un bouclier.",
            "task2": "Génération de niveaux procéduraux infinis changeant d'apparence en fonction de l'âge.",
            "task3": "Intégrer les modèles, les animations, les interfaces et l'audio réalisés par mes collègues.",
            "role": "Rôle: Programmeur",
            "team": "Taille de l'équipe: 7",
            "time": "Fenêtre de temps: 48 heures",
            "skills": "Compétences techniques: Unreal Engine, C++, Blueprints et Wwise"
        }
    }
}