{
    "portfolio": {
        "about": "ABOUT",
        "game-programmer": "GAME PROGRAMMER",
        "email": "Email",
        "phone": "Phone",
        "summary": "My name is Christopher Robidas. I've been a gamer since I was old enough to hold a controller, and I'm a passionate video game programmer. I am known as a good team player and for my great ability to communicate, adapt, and learn.",
        "current-role": "Current role",
        "current-role-value": "Back End Developer at Gameloft Montreal",
        "education": "Education",
        "education-value": "Bachelor of Computer Science - University of Sherbrooke",
        "technical-skills": "Technical skills",
        "languages": "Languages:",
        "technologies": "Technologies:",
        "softwares": "Softwares:",
        "project-summary": "Summary",
        "project-tasks": "I worked on the following features:",
        "project-play": "Play",
        "project-play-in-browser": "Play in browser",
        "project-test": {
            "summary": "Five Nights at Freddy's like game where you must cheat during an exam without being caught by your teacher. Made for the Game Jam Sherbrooke 2024.",
            "task1": "Captcha puzzle on the cellphone.",
            "task2": "End game UI menus displaying the player's game result.",
            "task3": "The tigger jumpscare causing the player to lose the game.",
            "task4": "Display mode and resolution settings and the UI to change them (not showing in the WebGL version).",
            "role": "Role: Programmer",
            "team": "Team size: 5",
            "time": "Time frame: 48 hours",
            "skills": "Technical skills: Unity and C#"
        },
        "project-sauve-chouris": {
            "summary": "Adventure and horror game where you need to save your bat friend while avoiding to get caugh by a grandma and her cat. Made for the Game Jam Sherbrooke 2023.",
            "task1": "Echolocation game mechanic used to find your way in the levels.",
            "task2": "Main menu, level selection menu, pause menu and game over menu.",
            "task3": "Cutscenes logic displaying the images and text.",
            "role": "Role: Programmer",
            "team": "Team size: 6",
            "time": "Time frame: 48 hours",
            "skills": "Technical skills: Unity, C# and Wwise"
        },
        "project-purrfect-escape": {
            "summary": "Escape game where you play as a cat wanting to escape from his house, but needs to solve puzzles to do so.",
            "task1": "Interaction system with the little circles and cat paw indicating the players the items they can interact with.",
            "task2": "Little screen and the buttons on the wall to input the secret code.",
            "task3": "Level design including deciding the house layout and the puzzles and key items locations.",
            "task4": "Main menu and pause menu.",
            "role": "Role: Programmer and level designer",
            "team": "Team size: 2",
            "time": "Time frame: 1 week",
            "skills": "Technical skills: Unity and C#"
        },
        "project-stepping-stones": {
            "summary": "Runner where you travel through the ages to bring back our history. Made for the Montreal Game Jam 2023.",
            "task1": "Character controller that runs automatically, can jump, can use a torch to burn walls and can block meteors with a shield.",
            "task2": "Infinite procedural level generation changing appearance depending on the age.",
            "task3": "Integrate models, animations, interfaces and the audio made by my colleagues",
            "role": "Role: Programmer",
            "team": "Team size: 7",
            "time": "Time frame: 48 hours",
            "skills": "Technical skills: Unreal Engine, C++, Blueprints and Wwise"
        }
    }
}